// Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let arr = ['a', 'b', 'c'];
// let num = [1, 2, 3];
//
// for (let i = 0; i < num.length; i++) {
//     arr.push(num [i]);
//     console.log(arr);
// }

// Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let arr = [1, 2, 3];
// let result = arr.reverse();
// console.log(result);

// Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let array = [1, 2, 3];
// array.push(4, 5, 6);
// console.log(array);

// Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let array = [1, 2, 3];
// array.unshift(4, 5, 6);
// console.log(array);

// Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let arr = ['js', 'css', 'jq'];
// result = arr.shift();
// console.log(arr);
// document.write(result);

// Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let arr = ['js', 'css', 'jq'];
// result = arr.pop();
// console.log(result);

// Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].

// let arr = [1, 2, 3, 4, 5];

// let result = arr.slice(3);
// console.log(result);

// Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].

// let arr = [1, 2, 3, 4, 5];
// let result = arr.slice(0, 2);
// console.log(result);

// Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, "a", "b", "c");
// console.log(arr);

// Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// let arr = [1, 2, 3, 4, 5];
//
// arr.splice(1, 0, 'a', 'b');
// arr.splice(6, 0, 'c');
// arr.splice(8, 0, "e");
//
// console.log(arr);

// Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// let num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
//
// for (let i = 0; i<= num.length; i++) {
//     if (i % 2 === 0) {
//         console.log([i]);
//     }
// }


// Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший

// let num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arr = [];
//
// for (let i = 0; i < num.length; i++) {
//     arr.push(num[i]);
// }
// console.log(arr);

//Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


// let num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arr = [];
//
// for (let i = 0; i < num.length; i++) {
// arr[i] = num[i];
// }
// console.log(arr);

// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

//     1. перебрати його циклом while

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// i = 0;
// while (i < arr.length) {
//     i++;
//     console.log(arr[i]);
// }

// 2. перебрати його циклом for

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 0; i< arr.length; i++) {
//     console.log(arr[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// i = 0;
//
// while (i < arr.length) {
// if (i % 2 === 1) {
//     console.log(arr[i]);
// }
//     i++;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i=0; i<arr.length; i++) {
//     if (i % 2 === 1) {
//         console.log(arr[i]);
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// i= 0;
// while (i<arr.length) {
//     if (arr[i] % 2===0) {
//         console.log(arr[i]);
//     }
//     i++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 0; i< arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i= 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     }
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// Завдання 7 у зв. порядку (замінити кожне число кратне 3 на слово "okten")
//
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = arr.length - 1; i >= 0; i--) {
// if (arr[i] % 3 === 0) {
//     arr[i] = 'okten';
// }
//     console.log(arr[i]);
// }


//Завдання 6 у зв. порядку (перебрати циклом for та вивести  числа тільки парні  значення)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = arr.length -1; i>=0;i--) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
// }

// Завдання 5 у зв. порядку (перебрати циклом while та вивести  числа тільки парні  значення)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = arr.length - 1;
// while (i >= 0) {
//     if (arr[i] % 2 === 0){
//         console.log(arr[i]);
//     }
//     i--;
// }

// Завдання 4 у зв. порядку (перебрати циклом for та вивести  числа тільки з непарним індексом)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = arr.length - 1;  i>=0; i--) {
//     if (i % 2 === 1) {
//         console.log(arr[i]);
//     }
// }

// Завдання 3 у зв. порядку ( перебрати циклом while та вивести  числа тільки з непарним індексом)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = arr.length -1;
// while (i>=0) {
//     if (i % 2 === 1) {
//         console.log(arr[i]);
//     }
//     i--;
// }

// Завдання 2 у зв. порядку (перебрати його циклом for)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }

// Завдання 1 у зв. порядку (перебрати його циклом while)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = arr.length -1;
// while (i>=0) {
//     console.log(arr[i]);
//     i--;
// }

// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)


